"""1. Создать класс TrafficLight (светофор) и определить у него один атрибут color (цвет) и метод running (запуск).
Атрибут реализовать как приватный.
В рамках метода реализовать переключение светофора в режимы: красный, желтый, зеленый.
Продолжительность первого состояния (красный) составляет 7 секунд, второго (желтый) — 2 секунды,
третьего (зеленый) — на ваше усмотрение. Переключение между режимами должно осуществляться только в
указанном порядке (красный, желтый, зеленый). Проверить работу примера, создав экземпляр и вызвав описанный метод.

Задачу можно усложнить, реализовав проверку порядка режимов, и при его нарушении выводить соответствующее сообщение
и завершать скрипт."""
from time import sleep


class TrafficLigh:
    __color = ['red', 'yellow', 'green']

    def running(self):
        for t in range(3):
            print(TrafficLigh.__color[t])
            if t == 0:
                sleep(7)
            elif t == 1:
                sleep(2)
            elif t == 2:
                sleep(9)


tl = TrafficLigh()
tl.running()
